In [1]:
# NumPy and Pandas Assignment
# Complete the following tasks by filling in the code where indicated.
# Ensure your notebook is well-documented with markdown cells explaining your code and result.

import numpy as np
import pandas as pd

# Task 1: NumPy Basics

### Array Creation

#### 1. Create an array of 10 zeros but set the fifth element to 1.

In [2]:
# creating an array of 10 zeros.
my_array = np.zeros(10)
# setting 5th element of array to 1.
my_array[4]=1
# print(array)

### 2. Create a 4x4 matrix with values ranging from 0 to 15.

In [3]:
# creating a 4x4 matrix with values ranging from 0 to 15.
matrix = np.random.randint(0,15,16).reshape(4,4)

### Array Operations

#### 3. Create two NumPy arrays: Perform element-wise addition, subtraction, multiplication, and division.

#### arr1: array([[41, 30, 10], [ 6, 35, 23], [23,  9, 10]])

#### arr2: array([[4, 29,  2], [5, 13,  3], [24, 16,  7]])

In [4]:
# solution
arr1 = np.array([[41, 30, 10], [ 6, 35, 23], [23,  9, 10]])
arr2 = np.array([[4, 29,  2], [5, 13,  3], [24, 16,  7]])
# Perform element wise addition:
addition = arr1 + arr2
# Perform element wise subtraction:
subtraction = arr1 - arr2 
# Perform element wise division:
division = arr1 / arr2
# Perform element wise multiplication:
multiplication = arr1 * arr2

### Array Slicing

#### 4. Given the array:

#### arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])

#### Extract elements from index 2 to 6.

In [5]:
# solution
arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
arr_idx_2_to_6 = arr[2:6]
# print (arr_idx_2_to_6)

### Using NumPy Methods

#### 5. Convert the array below to a 3Ã—3 NumPy array.

#### array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])

#### Find the mean, sum, and maximum value.

In [6]:
# solution
arr = np.array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
three_by_three = arr.reshape(3,3)
mean = np.mean(three_by_three)
sum = np.sum(three_by_three)
max_value = np.max(three_by_three)

# NB: round the mean to two decimal places
rounded_mean = np.round(mean, 2)

# Task 2: Pandas Basics

### Creating a Pandas Series

#### 1. Create a Pandas Series from the list [10, 20, 30, 40, 50] with index labels 'a', 'b', 'c', 'd', 'e'.

In [7]:
# solution
list1 = [10, 20, 30, 40, 50]
list2 = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data=list1, index=list2)

### Reading a CSV File

#### 2. Read a CSV file named "data.csv" into a Pandas DataFrame. The CSV file has the following columns: "Name", "Age", "Salary".

In [8]:
# solution
df = pd.read_csv("./data/data.csv")

### Slicing a DataFrame

#### 3. From the DataFrame created in Exercise 2, select only the first three rows.

In [9]:
first_three = df.head(3)
first_three

      Name  Age  Salary
0    Alice   29   73193
1      Bob   53   85398
2  Charlie   36   47162

### Manipulating a DataFrame - Adding a Column

#### 4. Add a new column named "Tax" to the DataFrame from Exercise 2. The tax should be calculated as 10% of the "Salary" column.

In [10]:
# solution
df['Tax']=df['Salary']*0.1
df['Score']=np.round((df['Salary']-df['Salary'].mean())/df['Salary'].std(), 2)
df

       Name  Age  Salary     Tax  Score
0     Alice   29   73193  7319.3   0.64
1       Bob   53   85398  8539.8   1.24
2   Charlie   36   47162  4716.2  -0.64
3     David   22   65853  6585.3   0.27
4       Eve   24   36168  3616.8  -1.19
5     Frank   58   69657  6965.7   0.46
6     Grace   41   85202  8520.2   1.23
7    Hannah   38   62421  6242.1   0.11
8     Isaac   50   74641  7464.1   0.71
9      Jack   47   38963  3896.3  -1.05
10    Karen   34   32136  3213.6  -1.38
11      Leo   49   41874  4187.4  -0.90
12     Mona   56   34070  3407.0  -1.29
13     Nina   49   91734  9173.4   1.55
14    Oscar   30   89539  8953.9   1.44
15     Paul   23   78720  7872.0   0.91
16    Quinn   31   54424  5442.4  -0.29
17   Rachel   54   59900  5990.0  -0.02
18    Steve   36   32163  3216.3  -1.38
19     Tina   56   52054  5205.4  -0.40

#### Filter the dataframe by the column "age" whereby the age is above 36 years

In [11]:
# solution
above_36_years=df[df['Age'] > 36]

# Task 3: Data Analysis with Pandas

### Aggregation - Compute Total and Mean Sales

#### 1. Given a dataset of sales transactions, compute the total and mean sales per region.

In [12]:
# Sample Data
sales_data = pd.DataFrame({
    "Region": ["North", "South", "North", "West", "South", "West"],
    "Sales": [1000, 1500, 1200, 1800, 1300, 1700]
})
sales_data.head()

  Region  Sales
0  North   1000
1  South   1500
2  North   1200
3   West   1800
4  South   1300

In [13]:
# solution
total_sales = sales_data['Sales'].sum()
sales_mean = sales_data['Sales'].mean()
# print(f"Total sales: {total_sales}, Sales mean: {sales_mean}")

### Merging - Combine Customer and Order Data

#### 2. Merge customers and orders data based on CustomerID.

In [14]:
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "CustomerName": ["Alice", "Bob", "Charlie", "David"]
})

orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 2, 4],
    "Amount": [250, 400, 600, 150]
})

# display(customers.head(2), orders.head(2))

In [15]:
# solution
combined_data = pd.merge(customers, orders, on="CustomerID")
# combined_data

### Joining - Left Join Employee Data

#### 4. Perform a left join between employees and departments on DeptID.

In [16]:
# NB: No test for this. Just an exercise for you to play around with
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "EmpName": ["John", "Jane", "Alice", "Bob"],
    "DeptID": [1, 2, 2, 3]
})

departments = pd.DataFrame({
    "DeptID": [1, 2],
    "DeptName": ["HR", "Finance"]
})

# display(employees.head(2), departments.head(2))

In [17]:
# solution
left_join_on_emp_and_dep = pd.merge(employees, departments, on='DeptID', how='left')

### Pivot Table - Summarize Sales Data

#### 4. Create a pivot table showing total sales for each Region and Product.

In [18]:
sales_pivot_data = pd.DataFrame({
    "Region": ["North", "North", "South", "South", "West", "West"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Sales": [200, 300, 150, 400, 250, 500]
})

sales_pivot_data.head(2)

  Region Product  Sales
0  North       A    200
1  North       B    300

In [19]:
# solution
pvt_table = pd.pivot_table(sales_pivot_data, index='Region', columns='Product', values='Sales', aggfunc='sum')
pvt_table

Product    A    B
Region
North    200  300
South    150  400
West     250  500